## Pandas - Data frames and series 

Pandas is powerful data manipulation library in python, widely used for data analysis and cleaning. It provides two primary data structure: Series and Data Frame.

A Pandas serues us a 1D array like objects that can hold any data type. It is similar to column in table. The basic difference between a series and dataframe is that series is 1D while dataframe is 2D mutable and can contain heterogeneous data .

In [2]:
import pandas as pd

In [8]:
##Series
##A pandas series is a one dimesnional array like object that can hold any data type. It is similar to colume in table..


import pandas as pd

data = [1,2,3,4,5]
series = pd.Series(data)
print("Series: \n",series)
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
## Create a series from dictionary 

data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [10]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [13]:
##Dataframe 
##Create a dataframe from a dictionary of list 

data = {
    'Name':["sanskar","kruish","sans"],
    'Age': [35,40,40],
    'City' : ['Kopargaon','Lasur','Aurangabad']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age        City
0  sanskar   35   Kopargaon
1   kruish   40       Lasur
2     sans   40  Aurangabad
<class 'pandas.core.frame.DataFrame'>

In [ ]:
import numpy as np 
np.array(df)                        ##we can do it like this also

array([['sanskar', 35, 'Kopargaon'],
       ['kruish', 40, 'Lasur'],
       ['sans', 40, 'Aurangabad']], dtype=object)

In [16]:
##Create a dataframe form a list of dictionaries 

data = [
    {'Name':'Sanskar','Age':20,'City':'Kopargaon'},
    {'Name':'Sanska','Age':200,'City':'Kopargao'},
    {'Name':'Sansk','Age':2000,'City':'Koparga'},
    {'Name':'Sans','Age':20000,'City':'Koparg'},
]


df = pd.DataFrame(data)
print(df)
print(type(df))

      Name    Age       City
0  Sanskar     20  Kopargaon
1   Sanska    200   Kopargao
2    Sansk   2000    Koparga
3     Sans  20000     Koparg
<class 'pandas.core.frame.DataFrame'>

In [22]:
df = pd.read_csv('sales_data.csv')
(df.head(5))

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [23]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [24]:
###Accessing data from dataframe 


data = {
    'Name':["sanskar","kruish","sans"],
    'Age': [35,40,40],
    'City' : ['Kopargaon','Lasur','Aurangabad']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age        City
0  sanskar   35   Kopargaon
1   kruish   40       Lasur
2     sans   40  Aurangabad
<class 'pandas.core.frame.DataFrame'>

In [25]:
df

      Name  Age        City
0  sanskar   35   Kopargaon
1   kruish   40       Lasur
2     sans   40  Aurangabad

In [26]:
df['Name']

0    sanskar
1     kruish
2       sans
Name: Name, dtype: object

In [27]:
type(df['Name'])

pandas.core.series.Series

In [28]:
df.loc[0]

Name      sanskar
Age            35
City    Kopargaon
Name: 0, dtype: object

In [29]:
df.loc[1]

Name    kruish
Age         40
City     Lasur
Name: 1, dtype: object

In [30]:
df.iloc[0]

Name      sanskar
Age            35
City    Kopargaon
Name: 0, dtype: object

In [31]:
df.loc[0][0]

C:\Users\admin\AppData\Local\Temp\ipykernel_16144\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'sanskar'

In [32]:
df.iloc[0][1]

C:\Users\admin\AppData\Local\Temp\ipykernel_16144\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

np.int64(35)

In [33]:
## Accessing a specified element

df['Name']

0    sanskar
1     kruish
2       sans
Name: Name, dtype: object

In [34]:
df

      Name  Age        City
0  sanskar   35   Kopargaon
1   kruish   40       Lasur
2     sans   40  Aurangabad

In [37]:
##Accessing a specified element

print(df.at[2,'Age'])

40

In [38]:

print(df.at[2,'Name'])

sans

In [40]:
##Acccessing a specified element using iat

df.iat[2,2]

'Aurangabad'

In [41]:
### Data Manioulation with data frame
df

      Name  Age        City
0  sanskar   35   Kopargaon
1   kruish   40       Lasur
2     sans   40  Aurangabad

In [ ]:
##Adding a column
df['Salary'] = [50000,60000,70000]
df

      Name  Age        City  Salary
0  sanskar   35   Kopargaon   50000
1   kruish   40       Lasur   60000
2     sans   40  Aurangabad   70000

In [ ]:
##Remove a column

df.drop('Salary',axis=1)            ##Drop is not a permanent operation it does not save the state of dataframe

      Name  Age        City
0  sanskar   35   Kopargaon
1   kruish   40       Lasur
2     sans   40  Aurangabad

In [44]:
df

      Name  Age        City  Salary
0  sanskar   35   Kopargaon   50000
1   kruish   40       Lasur   60000
2     sans   40  Aurangabad   70000

In [45]:
df.drop('Salary',axis=1,inplace=True)

In [46]:
df

      Name  Age        City
0  sanskar   35   Kopargaon
1   kruish   40       Lasur
2     sans   40  Aurangabad

In [47]:
## Add age to column 

df['Age'] = df['Age'] + 1

In [48]:
df

      Name  Age        City
0  sanskar   36   Kopargaon
1   kruish   41       Lasur
2     sans   41  Aurangabad

In [49]:
df.drop(0)

     Name  Age        City
1  kruish   41       Lasur
2    sans   41  Aurangabad

In [50]:
df

      Name  Age        City
0  sanskar   36   Kopargaon
1   kruish   41       Lasur
2     sans   41  Aurangabad

In [51]:
df.drop(0,inplace=True)

In [52]:
df

     Name  Age        City
1  kruish   41       Lasur
2    sans   41  Aurangabad

In [53]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [54]:
##Display the data types in each column 
print("Data Types: \n",df.dtypes)

Data Types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [55]:
##Describe the dataframe 
print("Statistical Summary: \n",df.describe())

Statistical Summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [57]:
## Group by a column and perform an aggregation 

grouped = df.groupby('Product Category')['Total Revenue'].mean()
print("Mean values by product category:\n", grouped)

Mean values by product category:
 Product Category
Beauty Products     65.54750
Books               46.54825
Clothing           203.22325
Electronics        874.56025
Home Appliances    466.15400
Sports             358.16300
Name: Total Revenue, dtype: float64